* what is database and why does it matter?
* * is a collection of data. structured computerized data which is accessible data with an interface
* what is sql and mysql

* what is the difference between sql and mysql
* * standard query language and database management system
*

In [23]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np

In [24]:
engine = create_engine('mysql+pymysql://root:password@localhost')

In [70]:
def get_query_result(query):
    with engine.connect() as connection:
        if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
            return pd.read_sql(query, connection)
        else:
            # print(text(query))
            query = text(query)
            result = connection.execute(query)
            # print('query executed successfully')
            # print("Result:", result)
            # print("Rowcount:", result.rowcount)
            return result

# Execute a select query and store the result in a DataFrame
# Commented out since it might not be applicable directly
# df = get_query_result(sql_select)
# print(df)

In [26]:
# Example query to create a database
sql_create_db = """
drop database house;
"""

In [27]:
sql_select = """SELECT * FROM some_table;"""

In [28]:
get_query_result('drop database house;')

drop database house;
query executed successfully

In [29]:
get_query_result('create database house;')

create database house;
query executed successfully

In [39]:
res = get_query_result('use house;')
res
# res.engine.cursor.CursorResult

use house;
query executed successfully

In [43]:
# Example usage
res = get_query_result('USE house;')

USE house;
query executed successfully
Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89debf3a0>
Rowcount: 0

In [47]:
get_query_result('select database();')

  database()
0      house

In [48]:
get_query_result("""create table room 
                    (
                        room_size varchar(255),
                        room_type varchar(255),
                        height float
                    )
                """)

create table room
                    (
                        room_size varchar(255),
                        room_type varchar(255),
                        height float
                    )

query executed successfully
Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d94b160>
Rowcount: 0

In [50]:
get_query_result(""" show tables """)

  Tables_in_house
0            room

In [52]:
get_query_result(""" desc room """).fetchall()

 desc room
query executed successfully
Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d8b55a0>
Rowcount: 3

[('room_size', 'varchar(255)', 'YES', '', None, ''),
 ('room_type', 'varchar(255)', 'YES', '', None, ''),
 ('height', 'float', 'YES', '', None, '')]

In [53]:
pd.DataFrame(get_query_result(""" desc room """).fetchall())

 desc room
query executed successfully
Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d8b5660>
Rowcount: 3

       Field          Type Null Key Default Extra
0  room_size  varchar(255)  YES        None
1  room_type  varchar(255)  YES        None
2     height         float  YES        None

In [82]:
def query_result_show(query):
    res = get_query_result(query)
    print("Result:", res)
    print("Rowcount:", res.rowcount)
    print("Returns Rows:", res.returns_rows)
    if res.returns_rows:
        return pd.DataFrame(res)
    # if isinstance(res, pd.DataFrame):
    #     print('isinstance')
    #     return res
    else:
        return res

In [85]:
query_result_show(""" desc room """)

Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d746980>
Rowcount: 3
Returns Rows: True

       Field          Type Null Key Default Extra
0  room_size  varchar(255)  YES        None
1  room_type  varchar(255)  YES        None
2     height         float  YES        None

In [102]:
# def get_query_result(query):
#     with engine.connect() as connection:
#         if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
#             return pd.read_sql(query, connection)
#         else:
#             query = text(query)
#             result = connection.execute(query)
#             # print(text(query))
#             print("Result:", result)
#             print("Rowcount:", result.rowcount)
#             print("Returns Rows:", result.returns_rows)
#             return result

In [136]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [137]:
get_query_result(""" show tables """)

Query executed successfully and returned data.

  Tables_in_house
0            cats
1            room

In [104]:
get_query_result('USE house;')

Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d5fcf40>
Rowcount: 0
Returns Rows: False

In [138]:
get_query_result('select database();')

Query executed successfully and returned data.

  database()
0      house

In [108]:
get_query_result('desc room;')

       Field          Type Null Key Default Extra
0  room_size  varchar(255)  YES        None
1  room_type  varchar(255)  YES        None
2     height         float  YES        None

In [139]:
get_query_result("""
show tables;
""")

Query executed successfully and returned data.

  Tables_in_house
0            cats
1            room

In [141]:
get_query_result("""
create table cats 
(
    name varchar(255),
    age int
)
""")

Query execution failed: (pymysql.err.OperationalError) (1050, "Table 'cats' already exists")
[SQL:
create table cats
(
    name varchar(255),
    age int
)
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [140]:
get_query_result("""show tables;""")

Query executed successfully and returned data.

  Tables_in_house
0            cats
1            room

In [123]:
get_query_result(""" use house """)

Result: <sqlalchemy.engine.cursor.CursorResult object at 0x70d89d80fc40>
Rowcount: 0
Returns Rows: False

In [125]:
sql="""insert into cats (name, age)
        values ('tom', 3);
"""

In [142]:
get_query_result("""
insert into `cats` (`name`, `age`)
values ('jerry', 3);
""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [145]:
get_query_result(""" select * from cats""")

Query executed successfully and returned data.

       name  age
0  Whiskers    3
1       tom    3
2       tom    3
3     jerry    3

In [147]:
get_query_result("""
insert into `cats` (`name`, `age`)
values 
('tom3', 3),
('tom4', 4),
('tom5', 5);
""")

Query executed successfully
Rowcount: 3
Returns Rows: False

In [149]:
get_query_result("""
select * from `cats`;

""")

Query executed successfully and returned data.

       name  age
0  Whiskers    3
1       tom    3
2       tom    3
3     jerry    3
4      tom3    3
5      tom4    4
6      tom5    5

In [151]:
get_query_result("""

create table people(
first_name varchar(50),
last_name varchar(50),
phone varchar(50)
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [152]:
get_query_result("""

show tables;

""")

Query executed successfully and returned data.

  Tables_in_house
0            cats
1          people
2            room

In [153]:
get_query_result("""

describe people;

""")

Query executed successfully and returned data.

        Field         Type Null Key Default Extra
0  first_name  varchar(50)  YES        None
1   last_name  varchar(50)  YES        None
2       phone  varchar(50)  YES        None

In [155]:
get_query_result("""

insert into people
values 
('John', 'Doe', '1234567890'),
('Jane', 'Doee', '9876543210'),
('Hafiz', 'Ahamed', '9876543210')
;

""")

Query executed successfully
Rowcount: 3
Returns Rows: False

In [156]:
get_query_result("""

select * from people;

""")

Query executed successfully and returned data.

  first_name last_name       phone
0       John       Doe  1234567890
1       Jane      Doee  9876543210
2      Hafiz    Ahamed  9876543210
3       John       Doe  1234567890
4       Jane      Doee  9876543210
5      Hafiz    Ahamed  9876543210